{
  "main": {
    "home": {
      "title": "Temple University HCI Lab | Human-Computer Interaction Research",
      "description": "Temple University HCI Lab conducts cutting-edge research in human-computer interaction, AI, NLP, and visualization to facilitate learning and empower non-experts.",
      "keywords": "HCI, Temple University, Human Computer Interaction, Research Lab, AI, NLP, Visualization, Learning Technology",
      "canonical": "https://yourdomain.com/",
      "ogImage": "/images/og/home.jpg"
    },
    "about": {
      "title": "About | Temple University HCI Lab",
      "description": "Learn about Temple University's Human-Computer Interaction Research Lab, our mission, history, and approach to advancing HCI research and education.",
      "keywords": "HCI Lab, Temple University, About, Research Mission, Human Computer Interaction, Academic Research",
      "canonical": "https://yourdomain.com/about",
      "ogImage": "/images/og/about.jpg"
    },
    "research": {
      "title": "Research | Temple University HCI Lab",
      "description": "Explore our research projects in human-computer interaction, AI applications, natural language processing, and visualization technologies at Temple University.",
      "keywords": "HCI Research, Temple University, AI Research, NLP, Visualization, Human Computer Interaction Projects",
      "canonical": "https://yourdomain.com/research",
      "ogImage": "/images/og/research.jpg"
    },
    "people": {
      "title": "People | Temple University HCI Lab Team",
      "description": "Meet our research team at Temple University HCI Lab - faculty, graduate students, and collaborators advancing human-computer interaction research.",
      "keywords": "HCI Team, Temple University, Research Faculty, Graduate Students, HCI Researchers, Lab Members",
      "canonical": "https://yourdomain.com/people",
      "ogImage": "/images/og/people.jpg"
    },
    "courses": {
      "title": "Courses | Temple University HCI Lab",
      "description": "Discover HCI courses and educational pathways at Temple University. Learn about our curriculum in human-computer interaction and related fields.",
      "keywords": "HCI Courses, Temple University, Human Computer Interaction Education, HCI Curriculum, Graduate Courses",
      "canonical": "https://yourdomain.com/courses",
      "ogImage": "/images/og/courses.jpg"
    },
    "sponsors": {
      "title": "Sponsors | Temple University HCI Lab",
      "description": "Learn about our research sponsors and partners who support innovative HCI research at Temple University. Explore sponsorship opportunities.",
      "keywords": "HCI Sponsors, Temple University, Research Funding, Sponsorship, Research Partners, HCI Lab Support",
      "canonical": "https://yourdomain.com/sponsors",
      "ogImage": "/images/og/sponsors.jpg"
    },
    "join": {
      "title": "Join Us | Temple University HCI Lab",
      "description": "Join Temple University HCI Lab! Apply for research positions, learn about opportunities for students and researchers in human-computer interaction.",
      "keywords": "Join HCI Lab, Temple University, Research Opportunities, HCI Jobs, Graduate Research, Apply Research Lab",
      "canonical": "https://yourdomain.com/join",
      "ogImage": "/images/og/join.jpg"
    }
  },
  "sub": {
    "about": {
      "events": {
        "title": "Events | Temple University HCI Lab",
        "description": "Stay updated with Temple University HCI Lab events, workshops, seminars, and research presentations. Join our academic community activities.",
        "keywords": "HCI events, Temple University, research seminars, workshops, lab presentations, academic events, HCI community",
        "canonical": "https://yourdomain.com/about?sub=events",
        "ogImage": "/images/og/about-events.jpg"
      },
      "contact-us": {
        "title": "Contact Us | Temple University HCI Lab",
        "description": "Get in touch with Temple University HCI Lab. Find our location, contact information, and reach out to our research team.",
        "keywords": "contact HCI lab, Temple University, lab location, research inquiries, HCI contact information",
        "canonical": "https://yourdomain.com/about?sub=contact-us",
        "ogImage": "/images/og/about-contact.jpg"
      }
    },
    "people": {
      "current": {
        "title": "Current Members | Temple University HCI Lab Team",
        "description": "Meet our current members—students and researchers who bring creativity, curiosity, and collaboration to every project. Join our innovative research community.",
        "keywords": "HCI, HCI Lab, Temple HCI Lab, current members, research team, graduate students, lab members, academic research",
        "canonical": "https://yourdomain.com/people",
        "ogImage": "/images/og/people-current.jpg"
      },
      "alumni": {
        "title": "Alumni | Temple University HCI Lab - Former Members & Their Impact",
        "description": "Meet our accomplished alumni who have gone on to make significant contributions in their fields. Discover the lasting impact of our research lab community.",
        "keywords": "HCI, HCI Lab, Temple HCI Lab, alumni, former members, research lab graduates, academic achievements, career outcomes",
        "canonical": "https://yourdomain.com/people?sub=alumni",
        "ogImage": "/images/og/people-alumni.jpg"
      },
      "collaborators": {
        "title": "Collaborators | Temple University HCI Lab Partners & External Contributors",
        "description": "Our valued collaborators and research partners who contribute to our lab's innovative projects and academic excellence.",
        "keywords": "HCI, HCI Lab, Temple HCI Lab, collaborators, research partners, academic collaboration, external contributors",
        "canonical": "https://yourdomain.com/people?sub=collaborators",
        "ogImage": "/images/og/people-collaborators.jpg"
      }
    },
    "sponsors": {
      "become-our-sponsor": {
        "title": "Become Our Sponsor | Temple University HCI Lab Partnership",
        "description": "Partner with Temple University HCI Lab. Learn about sponsorship opportunities and how your organization can support innovative HCI research.",
        "keywords": "sponsor HCI lab, Temple University, research sponsorship, partnership opportunities, HCI funding, academic collaboration",
        "canonical": "https://yourdomain.com/sponsors?sub=become-our-sponsor",
        "ogImage": "/images/og/sponsors-partnership.jpg"
      }
    }
  }
}
